grevaillot/svd_tools/headers/STM32L4R9/gpioc.h
#pragma once 

/* --- GPIOC: General-purpose I/Os ---------------------------------- */

/** @defgroup gpioc_registers General-purpose I/Os Register
@{*/

/** GPIOC_MODER GPIO port mode register **/
#define GPIOC_MODER			MMIO32(GPIOC_BASE + 0x00)
/** GPIOC_OTYPER GPIO port output type register **/
#define GPIOC_OTYPER			MMIO32(GPIOC_BASE + 0x04)
/** GPIOC_OSPEEDR GPIO port output speed register **/
#define GPIOC_OSPEEDR			MMIO32(GPIOC_BASE + 0x08)
/** GPIOC_PUPDR GPIO port pull-up/pull-down register **/
#define GPIOC_PUPDR			MMIO32(GPIOC_BASE + 0x0c)
/** GPIOC_IDR GPIO port input data register **/
#define GPIOC_IDR			MMIO32(GPIOC_BASE + 0x10)
/** GPIOC_ODR GPIO port output data register **/
#define GPIOC_ODR			MMIO32(GPIOC_BASE + 0x14)
/** GPIOC_BSRR GPIO port bit set/reset register **/
#define GPIOC_BSRR			MMIO32(GPIOC_BASE + 0x18)
/** GPIOC_LCKR GPIO port configuration lock register **/
#define GPIOC_LCKR			MMIO32(GPIOC_BASE + 0x1c)
/** GPIOC_AFRL GPIO alternate function low register **/
#define GPIOC_AFRL			MMIO32(GPIOC_BASE + 0x20)
/** GPIOC_AFRH GPIO alternate function high register **/
#define GPIOC_AFRH			MMIO32(GPIOC_BASE + 0x24)
/** GPIOC_BRR GPIO port bit reset register **/
#define GPIOC_BRR			MMIO32(GPIOC_BASE + 0x28)
/** GPIOC_ASCR GPIO port analog switch control register **/
#define GPIOC_ASCR			MMIO32(GPIOC_BASE + 0x2c)

/**@}*/


/** @defgroup gpioc_moder MODER GPIO port mode register
@{*/


#define GPIOC_MODER_MODER15_SHIFT		30
#define GPIOC_MODER_MODER15_MASK		0x03
/** @defgroup gpioc_moder_moder15 MODER15 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOC_MODER_MODER14_SHIFT		28
#define GPIOC_MODER_MODER14_MASK		0x03
/** @defgroup gpioc_moder_moder14 MODER14 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOC_MODER_MODER13_SHIFT		26
#define GPIOC_MODER_MODER13_MASK		0x03
/** @defgroup gpioc_moder_moder13 MODER13 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOC_MODER_MODER12_SHIFT		24
#define GPIOC_MODER_MODER12_MASK		0x03
/** @defgroup gpioc_moder_moder12 MODER12 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOC_MODER_MODER11_SHIFT		22
#define GPIOC_MODER_MODER11_MASK		0x03
/** @defgroup gpioc_moder_moder11 MODER11 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOC_MODER_MODER10_SHIFT		20
#define GPIOC_MODER_MODER10_MASK		0x03
/** @defgroup gpioc_moder_moder10 MODER10 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOC_MODER_MODER9_SHIFT		18
#define GPIOC_MODER_MODER9_MASK		0x03
/** @defgroup gpioc_moder_moder9 MODER9 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOC_MODER_MODER8_SHIFT		16
#define GPIOC_MODER_MODER8_MASK		0x03
/** @defgroup gpioc_moder_moder8 MODER8 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOC_MODER_MODER7_SHIFT		14
#define GPIOC_MODER_MODER7_MASK		0x03
/** @defgroup gpioc_moder_moder7 MODER7 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOC_MODER_MODER6_SHIFT		12
#define GPIOC_MODER_MODER6_MASK		0x03
/** @defgroup gpioc_moder_moder6 MODER6 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOC_MODER_MODER5_SHIFT		10
#define GPIOC_MODER_MODER5_MASK		0x03
/** @defgroup gpioc_moder_moder5 MODER5 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOC_MODER_MODER4_SHIFT		8
#define GPIOC_MODER_MODER4_MASK		0x03
/** @defgroup gpioc_moder_moder4 MODER4 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOC_MODER_MODER3_SHIFT		6
#define GPIOC_MODER_MODER3_MASK		0x03
/** @defgroup gpioc_moder_moder3 MODER3 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOC_MODER_MODER2_SHIFT		4
#define GPIOC_MODER_MODER2_MASK		0x03
/** @defgroup gpioc_moder_moder2 MODER2 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOC_MODER_MODER1_SHIFT		2
#define GPIOC_MODER_MODER1_MASK		0x03
/** @defgroup gpioc_moder_moder1 MODER1 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOC_MODER_MODER0_SHIFT		0
#define GPIOC_MODER_MODER0_MASK		0x03
/** @defgroup gpioc_moder_moder0 MODER0 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


/**@}*/

/** @defgroup gpioc_otyper OTYPER GPIO port output type register
@{*/

/** GPIOC_OTYPER_OT15 Port x configuration bits (y = 0..15) **/
#define GPIOC_OTYPER_OT15		(1 << 15)
/** GPIOC_OTYPER_OT14 Port x configuration bits (y = 0..15) **/
#define GPIOC_OTYPER_OT14		(1 << 14)
/** GPIOC_OTYPER_OT13 Port x configuration bits (y = 0..15) **/
#define GPIOC_OTYPER_OT13		(1 << 13)
/** GPIOC_OTYPER_OT12 Port x configuration bits (y = 0..15) **/
#define GPIOC_OTYPER_OT12		(1 << 12)
/** GPIOC_OTYPER_OT11 Port x configuration bits (y = 0..15) **/
#define GPIOC_OTYPER_OT11		(1 << 11)
/** GPIOC_OTYPER_OT10 Port x configuration bits (y = 0..15) **/
#define GPIOC_OTYPER_OT10		(1 << 10)
/** GPIOC_OTYPER_OT9 Port x configuration bits (y = 0..15) **/
#define GPIOC_OTYPER_OT9		(1 << 9)
/** GPIOC_OTYPER_OT8 Port x configuration bits (y = 0..15) **/
#define GPIOC_OTYPER_OT8		(1 << 8)
/** GPIOC_OTYPER_OT7 Port x configuration bits (y = 0..15) **/
#define GPIOC_OTYPER_OT7		(1 << 7)
/** GPIOC_OTYPER_OT6 Port x configuration bits (y = 0..15) **/
#define GPIOC_OTYPER_OT6		(1 << 6)
/** GPIOC_OTYPER_OT5 Port x configuration bits (y = 0..15) **/
#define GPIOC_OTYPER_OT5		(1 << 5)
/** GPIOC_OTYPER_OT4 Port x configuration bits (y = 0..15) **/
#define GPIOC_OTYPER_OT4		(1 << 4)
/** GPIOC_OTYPER_OT3 Port x configuration bits (y = 0..15) **/
#define GPIOC_OTYPER_OT3		(1 << 3)
/** GPIOC_OTYPER_OT2 Port x configuration bits (y = 0..15) **/
#define GPIOC_OTYPER_OT2		(1 << 2)
/** GPIOC_OTYPER_OT1 Port x configuration bits (y = 0..15) **/
#define GPIOC_OTYPER_OT1		(1 << 1)
/** GPIOC_OTYPER_OT0 Port x configuration bits (y = 0..15) **/
#define GPIOC_OTYPER_OT0		(1 << 0)

/**@}*/

/** @defgroup gpioc_ospeedr OSPEEDR GPIO port output speed register
@{*/


#define GPIOC_OSPEEDR_OSPEEDR15_SHIFT		30
#define GPIOC_OSPEEDR_OSPEEDR15_MASK		0x03
/** @defgroup gpioc_ospeedr_ospeedr15 OSPEEDR15 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOC_OSPEEDR_OSPEEDR14_SHIFT		28
#define GPIOC_OSPEEDR_OSPEEDR14_MASK		0x03
/** @defgroup gpioc_ospeedr_ospeedr14 OSPEEDR14 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOC_OSPEEDR_OSPEEDR13_SHIFT		26
#define GPIOC_OSPEEDR_OSPEEDR13_MASK		0x03
/** @defgroup gpioc_ospeedr_ospeedr13 OSPEEDR13 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOC_OSPEEDR_OSPEEDR12_SHIFT		24
#define GPIOC_OSPEEDR_OSPEEDR12_MASK		0x03
/** @defgroup gpioc_ospeedr_ospeedr12 OSPEEDR12 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOC_OSPEEDR_OSPEEDR11_SHIFT		22
#define GPIOC_OSPEEDR_OSPEEDR11_MASK		0x03
/** @defgroup gpioc_ospeedr_ospeedr11 OSPEEDR11 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOC_OSPEEDR_OSPEEDR10_SHIFT		20
#define GPIOC_OSPEEDR_OSPEEDR10_MASK		0x03
/** @defgroup gpioc_ospeedr_ospeedr10 OSPEEDR10 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


