grevaillot/svd_tools/headers/STM32L4R9/gpioc.h
/** GPIOC_LCKR_LCKK Port x lock bit y (y= 0..15) **/
#define GPIOC_LCKR_LCKK		(1 << 16)
/** GPIOC_LCKR_LCK15 Port x lock bit y (y= 0..15) **/
#define GPIOC_LCKR_LCK15		(1 << 15)
/** GPIOC_LCKR_LCK14 Port x lock bit y (y= 0..15) **/
#define GPIOC_LCKR_LCK14		(1 << 14)
/** GPIOC_LCKR_LCK13 Port x lock bit y (y= 0..15) **/
#define GPIOC_LCKR_LCK13		(1 << 13)
/** GPIOC_LCKR_LCK12 Port x lock bit y (y= 0..15) **/
#define GPIOC_LCKR_LCK12		(1 << 12)
/** GPIOC_LCKR_LCK11 Port x lock bit y (y= 0..15) **/
#define GPIOC_LCKR_LCK11		(1 << 11)
/** GPIOC_LCKR_LCK10 Port x lock bit y (y= 0..15) **/
#define GPIOC_LCKR_LCK10		(1 << 10)
/** GPIOC_LCKR_LCK9 Port x lock bit y (y= 0..15) **/
#define GPIOC_LCKR_LCK9		(1 << 9)
/** GPIOC_LCKR_LCK8 Port x lock bit y (y= 0..15) **/
#define GPIOC_LCKR_LCK8		(1 << 8)
/** GPIOC_LCKR_LCK7 Port x lock bit y (y= 0..15) **/
#define GPIOC_LCKR_LCK7		(1 << 7)
/** GPIOC_LCKR_LCK6 Port x lock bit y (y= 0..15) **/
#define GPIOC_LCKR_LCK6		(1 << 6)
/** GPIOC_LCKR_LCK5 Port x lock bit y (y= 0..15) **/
#define GPIOC_LCKR_LCK5		(1 << 5)
/** GPIOC_LCKR_LCK4 Port x lock bit y (y= 0..15) **/
#define GPIOC_LCKR_LCK4		(1 << 4)
/** GPIOC_LCKR_LCK3 Port x lock bit y (y= 0..15) **/
#define GPIOC_LCKR_LCK3		(1 << 3)
/** GPIOC_LCKR_LCK2 Port x lock bit y (y= 0..15) **/
#define GPIOC_LCKR_LCK2		(1 << 2)
/** GPIOC_LCKR_LCK1 Port x lock bit y (y= 0..15) **/
#define GPIOC_LCKR_LCK1		(1 << 1)
/** GPIOC_LCKR_LCK0 Port x lock bit y (y= 0..15) **/
#define GPIOC_LCKR_LCK0		(1 << 0)

/**@}*/

/** @defgroup gpioc_afrl AFRL GPIO alternate function low register
@{*/


#define GPIOC_AFRL_AFRL7_SHIFT		28
#define GPIOC_AFRL_AFRL7_MASK		0x0f
/** @defgroup gpioc_afrl_afrl7 AFRL7 Alternate function selection for port x bit y (y = 0..7)
@{*/
/**@}*/


#define GPIOC_AFRL_AFRL6_SHIFT		24
#define GPIOC_AFRL_AFRL6_MASK		0x0f
/** @defgroup gpioc_afrl_afrl6 AFRL6 Alternate function selection for port x bit y (y = 0..7)
@{*/
/**@}*/


#define GPIOC_AFRL_AFRL5_SHIFT		20
#define GPIOC_AFRL_AFRL5_MASK		0x0f
/** @defgroup gpioc_afrl_afrl5 AFRL5 Alternate function selection for port x bit y (y = 0..7)
@{*/
/**@}*/


#define GPIOC_AFRL_AFRL4_SHIFT		16
#define GPIOC_AFRL_AFRL4_MASK		0x0f
/** @defgroup gpioc_afrl_afrl4 AFRL4 Alternate function selection for port x bit y (y = 0..7)
@{*/
/**@}*/


#define GPIOC_AFRL_AFRL3_SHIFT		12
#define GPIOC_AFRL_AFRL3_MASK		0x0f
/** @defgroup gpioc_afrl_afrl3 AFRL3 Alternate function selection for port x bit y (y = 0..7)
@{*/
/**@}*/


#define GPIOC_AFRL_AFRL2_SHIFT		8
#define GPIOC_AFRL_AFRL2_MASK		0x0f
/** @defgroup gpioc_afrl_afrl2 AFRL2 Alternate function selection for port x bit y (y = 0..7)
@{*/
/**@}*/


#define GPIOC_AFRL_AFRL1_SHIFT		4
#define GPIOC_AFRL_AFRL1_MASK		0x0f
/** @defgroup gpioc_afrl_afrl1 AFRL1 Alternate function selection for port x bit y (y = 0..7)
@{*/
/**@}*/


#define GPIOC_AFRL_AFRL0_SHIFT		0
#define GPIOC_AFRL_AFRL0_MASK		0x0f
/** @defgroup gpioc_afrl_afrl0 AFRL0 Alternate function selection for port x bit y (y = 0..7)
@{*/
/**@}*/


/**@}*/

/** @defgroup gpioc_afrh AFRH GPIO alternate function high register
@{*/


#define GPIOC_AFRH_AFRH15_SHIFT		28
#define GPIOC_AFRH_AFRH15_MASK		0x0f
/** @defgroup gpioc_afrh_afrh15 AFRH15 Alternate function selection for port x bit y (y = 8..15)
@{*/
/**@}*/


#define GPIOC_AFRH_AFRH14_SHIFT		24
#define GPIOC_AFRH_AFRH14_MASK		0x0f
/** @defgroup gpioc_afrh_afrh14 AFRH14 Alternate function selection for port x bit y (y = 8..15)
@{*/
/**@}*/


#define GPIOC_AFRH_AFRH13_SHIFT		20
#define GPIOC_AFRH_AFRH13_MASK		0x0f
/** @defgroup gpioc_afrh_afrh13 AFRH13 Alternate function selection for port x bit y (y = 8..15)
@{*/
/**@}*/


#define GPIOC_AFRH_AFRH12_SHIFT		16
#define GPIOC_AFRH_AFRH12_MASK		0x0f
/** @defgroup gpioc_afrh_afrh12 AFRH12 Alternate function selection for port x bit y (y = 8..15)
@{*/
/**@}*/


#define GPIOC_AFRH_AFRH11_SHIFT		12
#define GPIOC_AFRH_AFRH11_MASK		0x0f
/** @defgroup gpioc_afrh_afrh11 AFRH11 Alternate function selection for port x bit y (y = 8..15)
@{*/
/**@}*/


#define GPIOC_AFRH_AFRH10_SHIFT		8
#define GPIOC_AFRH_AFRH10_MASK		0x0f
/** @defgroup gpioc_afrh_afrh10 AFRH10 Alternate function selection for port x bit y (y = 8..15)
@{*/
/**@}*/


#define GPIOC_AFRH_AFRH9_SHIFT		4
#define GPIOC_AFRH_AFRH9_MASK		0x0f
/** @defgroup gpioc_afrh_afrh9 AFRH9 Alternate function selection for port x bit y (y = 8..15)
@{*/
/**@}*/


#define GPIOC_AFRH_AFRH8_SHIFT		0
#define GPIOC_AFRH_AFRH8_MASK		0x0f
/** @defgroup gpioc_afrh_afrh8 AFRH8 Alternate function selection for port x bit y (y = 8..15)
@{*/
/**@}*/


/**@}*/

/** @defgroup gpioc_brr BRR GPIO port bit reset register
@{*/

/** GPIOC_BRR_BR15 Port Reset bit **/
#define GPIOC_BRR_BR15		(1 << 15)
/** GPIOC_BRR_BR14 Port Reset bit **/
#define GPIOC_BRR_BR14		(1 << 14)
/** GPIOC_BRR_BR13 Port Reset bit **/
#define GPIOC_BRR_BR13		(1 << 13)
/** GPIOC_BRR_BR12 Port Reset bit **/
#define GPIOC_BRR_BR12		(1 << 12)
/** GPIOC_BRR_BR11 Port Reset bit **/
#define GPIOC_BRR_BR11		(1 << 11)
/** GPIOC_BRR_BR10 Port Reset bit **/
#define GPIOC_BRR_BR10		(1 << 10)
/** GPIOC_BRR_BR9 Port Reset bit **/
#define GPIOC_BRR_BR9		(1 << 9)
/** GPIOC_BRR_BR8 Port Reset bit **/
#define GPIOC_BRR_BR8		(1 << 8)
/** GPIOC_BRR_BR7 Port Reset bit **/
#define GPIOC_BRR_BR7		(1 << 7)
/** GPIOC_BRR_BR6 Port Reset bit **/
#define GPIOC_BRR_BR6		(1 << 6)
/** GPIOC_BRR_BR5 Port Reset bit **/
#define GPIOC_BRR_BR5		(1 << 5)
/** GPIOC_BRR_BR4 Port Reset bit **/
#define GPIOC_BRR_BR4		(1 << 4)
/** GPIOC_BRR_BR3 Port Reset bit **/
#define GPIOC_BRR_BR3		(1 << 3)
/** GPIOC_BRR_BR2 Port Reset bit **/
#define GPIOC_BRR_BR2		(1 << 2)
/** GPIOC_BRR_BR1 Port Reset bit **/
#define GPIOC_BRR_BR1		(1 << 1)
/** GPIOC_BRR_BR0 Port Reset bit **/
#define GPIOC_BRR_BR0		(1 << 0)

/**@}*/

/** @defgroup gpioc_ascr ASCR GPIO port analog switch control register
@{*/

/** GPIOC_ASCR_ASC15 Port analog switch control **/
#define GPIOC_ASCR_ASC15		(1 << 15)
/** GPIOC_ASCR_ASC14 Port analog switch control **/
#define GPIOC_ASCR_ASC14		(1 << 14)
/** GPIOC_ASCR_ASC13 Port analog switch control **/
#define GPIOC_ASCR_ASC13		(1 << 13)
/** GPIOC_ASCR_ASC12 Port analog switch control **/
#define GPIOC_ASCR_ASC12		(1 << 12)
/** GPIOC_ASCR_ASC11 Port analog switch control **/
#define GPIOC_ASCR_ASC11		(1 << 11)
/** GPIOC_ASCR_ASC10 Port analog switch control **/
#define GPIOC_ASCR_ASC10		(1 << 10)
/** GPIOC_ASCR_ASC9 Port analog switch control **/
#define GPIOC_ASCR_ASC9		(1 << 9)
/** GPIOC_ASCR_ASC8 Port analog switch control **/
#define GPIOC_ASCR_ASC8		(1 << 8)
/** GPIOC_ASCR_ASC7 Port analog switch control **/
#define GPIOC_ASCR_ASC7		(1 << 7)
/** GPIOC_ASCR_ASC6 Port analog switch control **/
#define GPIOC_ASCR_ASC6		(1 << 6)
/** GPIOC_ASCR_ASC5 Port analog switch control **/
#define GPIOC_ASCR_ASC5		(1 << 5)
/** GPIOC_ASCR_ASC4 Port analog switch control **/
#define GPIOC_ASCR_ASC4		(1 << 4)
/** GPIOC_ASCR_ASC3 Port analog switch control **/
#define GPIOC_ASCR_ASC3		(1 << 3)
/** GPIOC_ASCR_ASC2 Port analog switch control **/
#define GPIOC_ASCR_ASC2		(1 << 2)
/** GPIOC_ASCR_ASC1 Port analog switch control **/
#define GPIOC_ASCR_ASC1		(1 << 1)
/** GPIOC_ASCR_ASC0 Port analog switch control **/
#define GPIOC_ASCR_ASC0		(1 << 0)

/**@}*/
